[
{"title": "Financial Associate - Hong Kong - Indeed.hk", "content": ["To be responsible for our financial reconciliations and liaise with Operations and Customer Service teams", "To analyse variances between actual and estimated costs.", "To take care of daily accounting operations (invoices, payment preparation, etc.)", "To prepare the monthly financial and business reporting.", "Maintain vendor and service provider relationships", "Present new strategies and assessments to stakeholders in a compelling fashion", "Provide critical assessment of all budgets and cost projections", "Minimum Bachelor in accounting, finance or related fields.", "2-4 years experience in Finance Analysis", "Ability to multi-task and deal with time pressure.", "Knows how to allocate the budget and establish a Cost Baseline", "Proficient in Microsoft Office Applications (Word, PowerPoint, Excel) – VBA and SQL skills are a pre.", "Good mathematical skills and interest in data science.", "Great communication and organization skills.", "Good fit with the startup culture.", "Hard-working. Not afraid to run the extra mile.", "Base Salary & Equity", "Flat team: Work side by side with the co-founding team;", "Flexible startup life. Work hard and take time when you need it;", "Great ownership from day one. Build your learning curve. Possibilities are limitless and just depend on you;", "Highly vibrant and international environment.", "Budget Allocation and Cost Baseline establishment: 2 years (Required)", "Financial Analysis: 2 years (Required)", "VBA and SQA skills: 1 year (Required)", "Bachelor's Degree (Required)", "Hong Kong (Required)"]},
{"title": "Research Assistant - Hung Hom, Kowloon - Indeed.hk", "content": ["Perform systematic testing and validation of various molecular detection assays", "Perform daily analytical experiments including nucleic acid extraction, real-time PCR and data analysis", "Perform daily laboratory operation, such as reagent preparation and equipment maintenance", "Manufacture and assemble laboratory parts or consumables", "Perform data analysis of the project", "Assist and support other staff as and when necessary and appropriate; and", "Handle any other relevant responsibilities and/or functions of our Group, as assigned from time to time", "Degree or Higher diploma in Biochemistry, Life Sciences, Chemistry or related fields; fresh graduates are also welcome", "Previous experience in a biology, biochemistry, or a chemistry lab is preferred", "Experienced in molecular diagnostics would be an advantage", "Strong attention to detail is a must", "While teamwork is of significant importance, candidates must be able to work independently yet cross-functionally with different teams of the company", "Strong desire to develop a career in Biotechnology", "Excellent command of both English and Chinese, both oral and in writing, is a pre-requisite;", "Strong analytical, problem-solving, multi-tasking, communication (both oral & written) and inter-personal skills;", "Dynamic team player with positive attitude, self-motivated, hardworking and detailed-minded;", "Proactive, independent and is able to prioritize (not only for oneself but also for the affected colleagues) and manage multiple tasks with a strong sense of responsibility for completing tasks", "Mature and results oriented with international mindset and strong personal drive to take initiative and get things done", "Salary negotiable"]},
{"title": "Software Engineer Intern - Kwun Tong, Kowloon - Indeed.hk", "content": ["Write client-side and server-side code for the Black Creek platform", "Work as an individual and in a team to deliver features or improve architecture", "Commit a change to production within the first month", "Proactively seek feedback and input from other team members and team", "Be able to deliver on small, well-understood deliverables spanning weeks", "Reports to Head of R&D (Technology)", "Final year student or graduate in BS/MS degree in Computer Science, Engineering, or a related subject", "Proficiency in Java, Scala, Python, or other general-purpose programming language", "Previous internships where one produced production quality code", "Good knowledge of algorithms, data structures, and OOD/OOP principles", "Strong knowledge of distributed systems", "Scala: 1 year (Preferred)", "Python: 1 year (Preferred)", "Java: 1 year (Preferred)", "Bachelor's Degree (Preferred)"]},
{"title": "Back Office Manager - Central, Hong Kong Island - Indeed.hk", "content": ["Provide operational support including fund valuation and reconciliation, trade booking, fee calculation, payment instruction etc.", "Handle trade/settlement processing and checking", "Prepare bank/broker account opening", "Prepare all the daily reports, month end report and year end report", "Help maintain portfolio data system to support data management and update the portfolio system", "Maintain and foster relationship both internal and external parties (custodian, broker, external lawyers, investment advisors etc.)", "Bachelor degree in a leading university in Finance, Economics, Engineering, Computer Science or related discipline", "Fluent in English and Mandarin", "Have a strong passion and interest in financial markets", "Desire to work within a collaborative, team-driven environment", "Strong attention to details, willingness to take initiatives", "Independent thinking and problem solving skills", "Responsible, ambitious and innovative", "Hands-on knowledge with programming skills (e.g. VBA, C++) is preferred", "Bachelor's (Preferred)"]},
{"title": "Data Scientist - Central, Hong Kong Island - Indeed.hk", "content": ["Central England", "£25,000.00 - £35,000.00\n ", "Industry, business & consultancy", "Combining domain knowledge and technical skills to understand and solve the complex challenges facing our clients.", "Using data science, analytics and a variety of analytical, statistical or machine learning techniques to interpret client data, helping them to make better-informed business decisions.", "Designing and developing custom software solutions or tools (e.g. visualisation).", "Building strong relationships, communicating and collaborating with clients and colleagues.", "BSc (min 2.1), MSc or PhD in science, mathematics or engineering. We recruit scientists, mathematicians and engineers because they have the domain knowledge required to understand our clients’ industry-related challenges.", "The ability to interpret complex data using a variety of analytical, statistical or machine learning techniques.", "Software underpins many of the solutions we provide, so you need to have some programming skills. We do not expect you to be an expert, but a good grounding in one of our core languages is required: Java, Python, C, C#, C++, R, Matlab.", "Excellent interpersonal skills and the ability to explain complex concepts to clients and colleagues from all backgrounds.", "The eagerness and capacity to quickly learn new domains and technologies."]},
{"title": "Junior Data Analyst - Tsim Sha Tsui, Kowloon - Indeed.hk", "content": ["Data entry and integrity checking.", "Assist in application development & enhancement on systems", "Maintain and analysein-house data.", "Interpret analysisresult and provide recommendations for an efficient workflow.", "Other ad hoc duties as required by operationsteam.", "Diploma or above in Business and Administration, Computer Science or related fields;", "Mature, well organized, can work independently and willing to work under pressure.", "Proficiency in MS Excel, knowledge of VBA preferred"]},
{"title": "Programmer - Kwai Chung, New Territories - Indeed.hk", "content": ["Responsible for system analysis, programming development, debug, testing, system development and legacy system support", "Collect user requirement, prepare technical documents and conduct training to users on application operations", "Follow up projects with vendors and users", "Provide support after office hour if necessary and perform ad hoc projects as assigned", "Bachelor’s degree in Computer Science or related disciplines", "At least 1-2 years’ experience in IT system development, preferably in Telecom industry", "Knowledge of Oracle RDBMS, PL/SQL, Java, Javascript, J2EE", "Independent, creative, detailed-oriented, self-driven personality with analytical mind, problem solving and good communication skills", "Fluent in Mandarin", "Immediately available will be an advantage", "5 days work", "8 hours/day", "Double pay", "Discretionary performance bonus", "Life insurance", "Medical insurance", "Birthday gift", "Marriage leave", "Birthday leave", "Compassionate leave", "Staff discount"]},
{"title": "Data Scientist - Kwun Tong, Kowloon - Indeed.hk", "content": ["We develop data- / AI-driven solutions for even smarter management of road traffic (e.g. AI-traffic light control) and rail infrastructure, as well as intermodal mobility. To do this, we work closely with our customers, partners and Siemens departments, with agile methods and rapid prototyping in line with the lean startup concept.", "\nIn this environment, you can use your expertise in Data Analytics and Machine Learning to help shape ecologically sustainable smart traffic for the future along with underlying functions for autonomous driving.", "\nIn our growing team of currently 10 AI-experts, you will develop innovative solutions for exploratory data analysis in highly complex data structures.", "\nYour aim is to identify unknown relationships in data from traffic management systems, traffic light systems, vehicles and other third-party sources in order to create cutting-edge solutions.", "\nYou will create reusable analytical models, operationalizing them in the analytics platform and visualizing the results", "\nYou will contribute to the successful realization of modern data analytics and machine learning within our projects", "\nYou will work directly with customers and project partners", "\nDelivering presentations to stakeholders from the business will be another element of your role", "PhD/Masters/Bachelor’s degree in Computer Science or related discipline from a reputed institute with grass-root experience of at least 2 years in solving complex problems and driving actionable insights from Petabytes of data.", "\nClosely follow latest developments in artificial intelligence and be an early adopter of disruptive trends/technologies", "\nYou are an expert in technologies, methods and algorithms in data analytics, especially data mining and machine learning.", "\nYou have experience in multidisciplinary projects and working with customers, and you have a proven track record of implementing big data projects", "\nYou are experienced in using analytical tools (e.g. Spotfire / Tableau) and systems, especially tools for data mining, and have a good understanding of ETL / ELT", "\nProven deep technical expertise in designing and programming large scale data driven solutions using any of the high level programming languages viz. Java/Python/C++/Scala", "\nCollaborate with team members from prototyping through production, present developed solutions and recommendations to business partners, and influence future product roadmap and strategy based on insights", "\nHands-on experience with one or more of the following is a must:", "\nBuilding analytical solutions leveraging distributed computing frameworks and cloud based data engineering solutions, especially Hadoop and Spark to build and deploy products at scale", "\nExperience in Machine Learning techniques such as Forecasting, Classification, Clustering, Text Mining, Decision Trees, Random Forest and Search algorithms", "\nUnderstanding and hands-on experience in training deep convolutional and/or recurrent networks using frameworks like Tensorflow, Caffe, MXNet, etc.", "\nResearch, develop and prototype software technologies related to object detection, tracking, 3D reconstruction, SLAM and photometric stereo", "\nExperience in the following will be an added advantage:", "\n1-2 years’ experience working on image processing and computer vision problems with a clear understanding and ability to implement algorithms (especially deep learning algorithms)", "\nHands-on experience using OpenCV and OpenGL", "\nOptimization techniques for model training and deployment on GPUs"]},
{"title": "Junior Data Scientist - Hung Hom, Kowloon - Indeed.hk", "content": ["Lead projects under the supervision of Department Head of Analytics Team;", "Be responsible for extracting, transforming, reporting, and visualizing data;", "Generate reports and analytics using Python and the Pandas framework;", "Build reports and visualizations to present data, generate insights from disparate sources of data, including relational and SQL databases, REST APIs, and flat files;", "Work with different teams to provide insights and recommendations on what works and what doesn’t in social marketing and business performances", "Bachelor’s degree or above in a quantitative discipline (Mathematics, Computer Science, Engineering);", "Experiences in programming languages such as Python, Java, C++;", "Knowledge of quantitative programming including R, MATLAB, SAS;", "Proficient SQL will be advantage;", "Passionate about new technologies and data analysis"]},
{"title": "Quant Research - Central, Hong Kong Island - Indeed.hk", "content": ["Quantitative Researchers play an important role in our Quantitative Research team, which is responsible for developing and testing automated trading strategies using sophisticated statistical techniques.", "You’ll get to apply and hone your quantitative skills in a structured program that allows you to work closely with, and learn from, those who are thriving in this exciting and growing field.", "Conceptualize valuation strategies, develop and continuously improve upon mathematical models, and help translate algorithms into code.", "Backtest and implement trading models and signals in a live trading environment.", "Use unconventional data sources to drive innovation.", "Conduct research and statistical analysis to build and refine monetization systems for trading signals.", "Advanced training in Mathematics, Statistics, Physics, Computer Science, or another highly quantitative field (Bachelors, Masters, Ph.D.).", "Strong knowledge of probability and statistics (e.g., machine learning, time-series analysis, pattern recognition, NLP).", "Prior experience working in a data-driven research environment.", "Experience with analytical packages (e.g., R, Matlab).", "Ability to manage multiple tasks and thrive in a fast-paced team environment.", "Excellent analytical skills, with strong attention to detail.", "Strong written and verbal skills.", "Bachelor's Degree (Required)", "English (Preferred)"]},
{"title": "Machine Learning Research - Central, Hong Kong Island - Indeed.hk", "content": ["Participate in the development and maintenance of the company's Machine Learning Team; assist with the development of Machine Learning Algorithms", "Develop API and Test cases", "Assist with data collection and preparation", "A minimum of 2 years' hands-on experiences in Python development", "Knowledge in Python libraries (e.g. NumPy, SciPy, TensorFlow, etc.)", "Good logical thinking and analytical skills", "Excellent proficiency in both spoken and written English", "Candidate with research/ academic experience in Python", "BSc./ MSc./ PhD. inComputer Science / Mathematics / Statistics or", "Machine Learning: 1 year (Preferred)", "Bachelor's Degree (Required)", "English (Preferred)"]},
{"title": "Data Analyst (Python & SQL) - fresh grad welcome - Hong Kong - Indeed.hk", "content": ["Develop data quality solutions using Python and SQL.", "Resolve data quality issues by working with Commission staff in various divisions.", "Provide support and training to SFC staff, to facilitate the adoption of data quality solutions.", "Conduct data analysis in general to support regulatory functions.", "A bachelor’s degree in Computer Science, or other related fields;", "Previous experience with SQL and Python;", "Proactive, analytical, alert to potential problems and resourceful in making well considered suggestions;", " Good communication and interpersonal skills;", "Excellent command of spoken and written English and Chinese;", "Self-motivated and result-oriented;", "Fresh graduates will also be considered"]},
{"title": "Software Project Manager - Sheung Wan, Hong Kong Island - Indeed.hk", "content": ["Strong knowledge/experience in software engineering best practices (i.e. OOD, modularity, extensibility, reusability and maintainability)", "Strong understanding of software development lifecycle practices and processes. Hands-on deep practical knowledge of Agile/Scrum is required", "Stong knowledge in CD/CI.", "Good in Project, Time and Resource Planning.", "Dealing directly with Management representatives from the business and clients.", "Managing development, system testing, UAT and implementation.", "Point person for internal staff and external client technology representatives throughout the project lifecycle.", "Project status reporting to Technology and Business Management.", "Must be PMP or Prince2 certified", "Strong experience in running projects using Agile methodologies, especially Scrum.", "8+ years of I.T experience with at least 3 years as a PM", "Bachelor’s degree in Computer Science or related field preferred", "Excited about technology, and quality", "Software development background focused on web environments in high security environments such as payments, banking or ecommerce is an absolute must.", "Ticketing experience a strong advantage", "Exposure to a client-facing role, dealing with business users up to Senior Management level.", "Bachelor’s degree in Computer Science or related field preferred", "PMP or Prince2 / Certified Scrum Master", "Work with people who are passionate about technology", "Fun relaxed work environment", "Competitive Salary", "Medical insurance", "Project Management: 3 years (Required)"]},
{"title": "Associate / Consultant, Data Analytics, Hong Kong/Shenzhen - Hong Kong - Indeed.hk", "content": ["Responsible for day-to-day project activities including interaction with other team members, professionals from other firms involved in the engagement, and client personnel;", "\n", "Identify, research, and organise information to assess the appropriateness and sufficiency of available data to facilitate effective data access and analysis;", "\n", "Identify the relationships among multiple sources and types of information to facilitate effective data analysis;", "\n", "Analyse and interpret historical financial, operational, and transactional data;", "\n", "Assist with preparation of reports, written analyses, trial and other presentations, quantitative exhibits, and other client deliverables regarding project scope and/or results of work performed;", "\n", "Maintain detailed working records reflecting assumptions, methodologies, and information sources employed during the performance of all analytical tasks;", "\n", "Participate in client meetings to review results of work performed; and", "\n", "Maintain professional image within the company and project the same to those outside of the company.", "\n", "\n", "\n", "\n", "Bachelor's Degree in one or more of these areas (Computer Science, Management Information Systems or Engineering)", "\n", "Strong ability and desire to utilise technology to solve complex problems;", "\n", "Experience with programming in one or more of the following languages: VB.NET, C#.NET, Python, PHP, PERL, or similar languages;", "\n", "Knowledge of database technologies, such as Oracle, SQL Server, Hadoop, T-SQL, PL-SQL, Hive;", "\n", "Experience in using an advanced data analytics platform, such as R, SAS, Strata, is preferred but not required;", "\n", "Ability to work both independently and as part of a team in a high-paced, multi-task environment with attention to detail;", "\n", "Ability to interface with team members and client personnel in demanding, deadline-driven situations;", "\n", "Excellent communication (both written and verbal), logical reasoning, and organisational skills;", "\n", "Flexibility with respect to assigned tasks and engagements due to challenging deadlines, changing deliverables, and evolving task priorities;", "\n", "Strong work ethic, eagerness to learn, and motivation to succeed; and", "\n", "Fluent in written and spoken English; fluency in written and spoken Cantonese and/or Mandarin preferred but not required.", "\n", "\n", "\n", "\nThe selected candidate will report directly to the Senior Director and Managing Director, D&A. He or she will also have significant interaction with project team members from other service lines.", "\n", "\nMore experienced candidates will be considered as Consultant.", "\n#LI-MN1"]},
{"title": "BioMind Data Scientist/Engineer (Relocate to Beijing) - Hong Kong Island - Indeed.hk", "content": ["Bachelor / Master / PhD in engineering or computer science or mathematics or physics", "Knows computer vision / image segmentation, localization, classification", "Knows tensorflow or theano or torch", "Strong python, C++ or java coder", "Good knowledge of numpy, pandas, sklearn, scipy, seaborn", "Knows how to build deep learning models like RNN and CNN and other neural network models.", "May require to relocate to China, Beijing."]},
{"title": "Summer Interns (June - August 2019) - Central, Hong Kong Island - Indeed.hk", "content": ["Work with traders and developers on creating and testing trading strategies\n", "Perform data analysis and prepare summary of findings\n", "Meet with CEO and traders weekly to review data\n", "Report to and be mentored by junior trader, who was also an intern\n", "Help set up new trading desks\n", "Ad hoc projects\n", "\n", "\n", "\n", "\n", "\n", "Degree in Finance, Math, Economics, or Computer Science preferred\n", "Students who are going to graduate in the year of 2020 or later\n", "GPA 3.5 or above\n", "Willing to take an academic leave during the internship\n", "Full-time only, part-time will not be considered\n", "Strong interest in finance, trading, and business news\n", "Programming skills (e.g. R, Python, Excel VBA) and experience in data science are expected\n", "Knowledge in fields related to statistical analysis (e.g. machine learning) is a plus\n", "Ability to work in a fast paced and highly collaborative environment\n", "Strong command of spoken and written English\n", "Self-starter that can lead and work independently\n", "\n", "\nTo apply, please send your detailed resume via email."]},
{"title": "Data Centre Assistants /Engineers (Fresh or Experienced)$15-25K - Hong Kong - Indeed.hk", "content": ["Provide Technical Support services including: Data Centre operations, equipment maintenance and system administration", "Perform daily system monitoring, verifying the integrity and availability of all hardware, server resources and systems, reviewing system and application logs", "Develop Tools/Utilities to automate the daily tasks for supporting operation", "Perform daily backup operations, ensure all required file systems and system data are successfully backup to the appropriate media, recovery tapes or disks are created, and media is recycled", "Setup and conduct proof-of-concept testing and evaluation for assessing new technology, technical standards and products", "Support for local networking devices (Cisco / Juniper / Brocade / H3C) Incident handling, problem troubleshooting and escalation to upper tier Maintain accurate records, document all problems, and prepare reports Exhibit quality workmanship on all work", "Provide training workshops to new or less experienced staff Manage multiple concurrent interdisciplinary projects and ability to work in a team", "Technical Institute/University Graduate in Computer Science or related discipline", "Fresh or with experience in system admin experiences", "(REMARK: On-the-job training will be provided to fresh graduates)", "Familiarity with various operations server systems (Windows Servers/Linux) and Virtualization platforms (VMWare) and system administration tools such as Backup/Restore, account administration, Patch Management, etc for experienced candidates", "Can speak & write English is a must"]},
{"title": "QA Tester (Automation) - Hong Kong - Indeed.hk", "content": ["Review the Functional Requirement Specification", "Hands on the whole life of the Software testing", "Experience in Regression Testing and Automation Testing", "Prepare project plan, test strategies and testing schedules", "Provide end to end delivery of large applications", "Analyze business requirements, coordinate with business analysts and testing team to ensure expectations are met and match with testable requirements", "Perform testing activities and review deliverables", "Higher Diploma or above in IT, Computer Science or related discipline", "At least 2 year experience in conducting Software Testing", "Great verbal and written communication skills in English", "Excellent at time & project management and interpersonal skills", "Open to all Nationalities, will offer Working VISA if needed.", "QA/ Tester: 1 year (Preferred)"]},
{"title": "Data Analyst - Hong Kong - Indeed.hk", "content": ["Manage, consolidate and integrate data from multiple databases, analyze and identify data insights", "Develop, refine and review data management and analytics procedures, systems, workflows and other best practices", "Propose and review ideas and scenarios identified from data analysis and process reviews", "Provide insights and recommendations based on data analytics to facilitate business needs and decision making", "Keep abreast and update record of market information and trends", "Maintain and conduct periodic or ad hoc health check of the databases, monitor data integrity and manage risk", "Degree in Quantitative Science / Data Management / Business Analysis or related discipline", "Minimum 3 years of solid experience in data planning, market research or statistical modeling", "Proficiency in conceptualizing and developing prospecting methodologies in data analysis and process reviews", "Strong business acumen, analytical skills and numerical sense", "Strong communication and presentation skills", "Excellent in MS Office especially Excel & PowerPoint", "Preferred experience in business intelligent tools or analytic software e.g. Power BI, Qlikview, Tableau, etc.", "Proficient in written and spoken English and Chinese"]},
{"title": "Data Analyst - Hong Kong - Indeed.hk", "content": ["Own the design, development and maintenance of metrics, reports, analyses, dashboards, etc. to drive key business decisions.", "Build and analyze key metrics to monitor business performance and analyze underlying effects.", "Work closely with Data Analysts, BI Engineers and Data Engineers.", "Support business in identifying and defining key KPIs to monitor and best visualization.", "Support ad hoc analysis needs across the team.", "Bachelor's degree in Computer Science, Mathematics, Statistics, Finance, related technical field, or equivalent work experience.", "You've been actively working as a BI Engineer and/or Business Analyst for at least 3 years.", "Experience using SQL and databases, BI / Data visualization tools (Power BI, Tableau).", "Detail-oriented, self-starter, ability to timely execute and manage projects.", "You do not need to be micromanaged; to accomplish team and company goals, you can wear multiple hats and pickup new technologies and languages.", "You have a strong business sensitivity and understand the importance of delivering values to the end-users. Experience in ecommerce/marketplace is a plus but not mandatory", "Problem solver with a strong communication skills, a positive attitude, and empathy.", "Fluent in English", "Permanent contract based in our APAC HQ in Hong Kong", "Technical conferences, meetups to learn more and share more", "PC or Mac of your choice, it's up to you!", "French/English lessons to upgrade your level", "Attractive salary and bonus scheme"]},
{"title": "Senior Data Analyst - Hong Kong - Indeed.hk", "content": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Work location will be in Causeway Bay office"]},
{"title": "Medical Science Liaison - Hong Kong - Indeed.hk", "content": ["\nField-based medical expert in the Medical Science Liaison (MSL) group within the medical organization", "\nAn integral position in communicating accurate, clear, and valued information regarding our science and products to multiple levels within the medical community and are responsible for providing field observations to internal stakeholders", "\nSupport Regional TA Head and local TA Lead in developing local territory R&D Tactics", "\nEngage with healthcare stakeholders to educate and communicate clinical and scientific data to advance the scientific platform as aligned with Amgen’s corporate goals and objectives", "\nEducate and communicate clinical value, outcomes and economic data to payers, providers, key stakeholders, advocacy, and access enablers", "\nRespond to unsolicited inquiries consistent with the MSL compliance standards", "\nProvide and/or present field observations and insights to internal stakeholders", "\nExecute scientific engagement plan according to annual MSL goals and metrics", "\nDevelop and implement local OL plans in line with the scientific engagement plan", "\nSupport speaker training as requested and ensure the speakers are updated on new data", "\nSupport Amgen sponsored research and may serve as a study lead", "\nLiaise with potential investigators in non-sponsored clinical research", "\nLead and/or participate on project teams that support MSL strategies and tactics as delegated by MSL leadership", "\nAdvance MSL value proposition, identify gaps, achieve results, and set an example for others to follow by consistently demonstrating Amgen values and leadership attributes. Demonstrate tact and professionalism when communicating and interacting with others", "\nLead and support congress activities as aligned with strategy", "\nCompliantly collaborate with cross-functional colleagues. May serve as main point of contact", "\nMaintain clinical acumen and expertise and timely completion of assigned training. May serve as a training lead", "\nMay serve as a New Hire Mentor and/or International MSL mentor/trainer", "Medical or scientific education or experience from similar positions", "\nAdvanced degree (e.g. PhD , MD) preferred or strong demonstration of equivalent combination of relevant educational and professional training", "Minimum 3 years of experience gained in pharmaceutical / biotech industry with MSL experience preferred", "\nExperience in sales force, affiliate Medical Department or Clinical Development will be an advantage", "\nWillingness to travel", "\nExperience with clinical study management and conduct", "\nMedical / scientific research experience", "\nNetwork of customer contacts", "\nScientific expertise in the therapeutic area, related products, disease state, and interested in latest discoveries", "\nKnowledge of value messages, clinical outcomes and patient benefits for the products", "\nHas solid understanding of their country local health care system and decision-making, stays on top of changes", "\nDemonstrates strong project management and presentation skills", "\nKnowledge of commercialization and business practices", "\nGood knowledge of clinical research, drug safety, legal and compliance environment", "\nWillingness to continuously expand medical, scientific, market, and industry knowledge"]},
{"title": "Summer Intern, Data Analytics - Wan Chai, Hong Kong Island - Indeed.hk", "content": ["Dashboards and analysis that give the business insight into the key cost drivers and health of the populations - across key business lines.\n", "Enhancements to data pipelines and infrastructure related to health plan cost and utilisation\n", "Document outlining key metrics related to the health of our population (from a clinical, cost, and utilisation perspective) and recommended updates to our data pipelines and analytics function that could not be addressed in the summer.\n", "Pursuing a degree in a data- and modeling-heavy discipline (e.g. statistics, computer science, economics, econometrics, linguistics, neuroscience, astrophysics, atmospheric science, geophysics, etc.)\n", "Proficient skills in statistics and data modeling (regression, significance testing, multivariate statistics, dirty data, sparse data)\n", "Excellent programming skills in SAS and/or Python\n", "Demonstrated experience in data integration in various ways (web APIs, SQL, noSQL, files)\n", "Able to and willing to strive in a fast paced environment\n", "An interest in health is a plus\n"]},
{"title": "Associate / Consultant, Data Analytics, Hong Kong/Shenzhen - Hong Kong - Indeed.hk", "content": ["Responsible for day-to-day project activities including interaction with other team members, professionals from other firms involved in the engagement, and client personnel;", "\n", "Identify, research, and organise information to assess the appropriateness and sufficiency of available data to facilitate effective data access and analysis;", "\n", "Identify the relationships among multiple sources and types of information to facilitate effective data analysis;", "\n", "Analyse and interpret historical financial, operational, and transactional data;", "\n", "Assist with preparation of reports, written analyses, trial and other presentations, quantitative exhibits, and other client deliverables regarding project scope and/or results of work performed;", "\n", "Maintain detailed working records reflecting assumptions, methodologies, and information sources employed during the performance of all analytical tasks;", "\n", "Participate in client meetings to review results of work performed; and", "\n", "Maintain professional image within the company and project the same to those outside of the company.", "\n", "\n", "\n", "\n", "Bachelor's Degree in one or more of these areas (Computer Science, Management Information Systems or Engineering)", "\n", "Strong ability and desire to utilise technology to solve complex problems;", "\n", "Experience with programming in one or more of the following languages: VB.NET, C#.NET, Python, PHP, PERL, or similar languages;", "\n", "Knowledge of database technologies, such as Oracle, SQL Server, Hadoop, T-SQL, PL-SQL, Hive;", "\n", "Experience in using an advanced data analytics platform, such as R, SAS, Strata, is preferred but not required;", "\n", "Ability to work both independently and as part of a team in a high-paced, multi-task environment with attention to detail;", "\n", "Ability to interface with team members and client personnel in demanding, deadline-driven situations;", "\n", "Excellent communication (both written and verbal), logical reasoning, and organisational skills;", "\n", "Flexibility with respect to assigned tasks and engagements due to challenging deadlines, changing deliverables, and evolving task priorities;", "\n", "Strong work ethic, eagerness to learn, and motivation to succeed; and", "\n", "Fluent in written and spoken English; fluency in written and spoken Cantonese and/or Mandarin preferred but not required.", "\n", "\n", "\n", "\nThe selected candidate will report directly to the Senior Director and Managing Director, D&A. He or she will also have significant interaction with project team members from other service lines.", "\n", "\nMore experienced candidates will be considered as Consultant.", "\n#LI-MN1"]},
{"title": "Data Analyst - Hong Kong - Indeed.hk", "content": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "Work location will be in Causeway Bay office"]},
{"title": "Associate Data Scientist - Hong Kong - Indeed.hk", "content": ["Work closely with internal business units such as Marketing & Engagement, Finance and Sales teams and C-Suite", "Understand business stakeholder’s needs through strong collaborative relationships and translate these needs into analytics problems", "Use key tools of analytics and data science to come up with tangible, sustainable solutions, and present back to business units with recommendations", "Evaluate model performance and iterate to optimise", "Provide technical leadership to other analysts and data scientists", "Bachelor/ Master Degree in Mathematics, Statistics, Physics, Computer Science, Engineering, Psychology, Social Sciences or related discipline", "3 to 5 years of working experience with big datasets and on large scale analytical projects", "Extensive experience in building data and analytics solutions, data mining, data manipulation, statistical analysis and data visualisation", "Experience in leading large scale analytics projects that drive significant change", "Experience in digital and multichannel marketing", "Expertise in a selection of the following: Hadoop, Spark, SQL, SAS, R, Python, Machine Learning, NoSQL databases, Adobe Marketing Suite, Digital Analytics, etc.", "Unearthing knowledge that has led to tangible changes in business value and processes", "Customer-focus mindset – with a view to improve customer lives", "Strong project management and technical leadership skills", "Strong communication skills", "Passion for their field with genuine interest in human behaviour and curiosity about people and a drive to make things better", "High energy, can-do attitude and ability to deliver high quality output to fast paced deadlines", "Proven track record of working in data mature environment and driving tangible benefits to marketing campaigns"]},
{"title": "Associate / Consultant, Data Analytics, Hong Kong/Shenzhen - Hong Kong - Indeed.hk", "content": ["Responsible for day-to-day project activities including interaction with other team members, professionals from other firms involved in the engagement, and client personnel;", "\n", "Identify, research, and organise information to assess the appropriateness and sufficiency of available data to facilitate effective data access and analysis;", "\n", "Identify the relationships among multiple sources and types of information to facilitate effective data analysis;", "\n", "Analyse and interpret historical financial, operational, and transactional data;", "\n", "Assist with preparation of reports, written analyses, trial and other presentations, quantitative exhibits, and other client deliverables regarding project scope and/or results of work performed;", "\n", "Maintain detailed working records reflecting assumptions, methodologies, and information sources employed during the performance of all analytical tasks;", "\n", "Participate in client meetings to review results of work performed; and", "\n", "Maintain professional image within the company and project the same to those outside of the company.", "\n", "\n", "\n", "\n", "Bachelor's Degree in one or more of these areas (Computer Science, Management Information Systems or Engineering)", "\n", "Strong ability and desire to utilise technology to solve complex problems;", "\n", "Experience with programming in one or more of the following languages: VB.NET, C#.NET, Python, PHP, PERL, or similar languages;", "\n", "Knowledge of database technologies, such as Oracle, SQL Server, Hadoop, T-SQL, PL-SQL, Hive;", "\n", "Experience in using an advanced data analytics platform, such as R, SAS, Strata, is preferred but not required;", "\n", "Ability to work both independently and as part of a team in a high-paced, multi-task environment with attention to detail;", "\n", "Ability to interface with team members and client personnel in demanding, deadline-driven situations;", "\n", "Excellent communication (both written and verbal), logical reasoning, and organisational skills;", "\n", "Flexibility with respect to assigned tasks and engagements due to challenging deadlines, changing deliverables, and evolving task priorities;", "\n", "Strong work ethic, eagerness to learn, and motivation to succeed; and", "\n", "Fluent in written and spoken English; fluency in written and spoken Cantonese and/or Mandarin preferred but not required.", "\n", "\n", "\n", "\nThe selected candidate will report directly to the Senior Director and Managing Director, D&A. He or she will also have significant interaction with project team members from other service lines.", "\n", "\nMore experienced candidates will be considered as Consultant.", "\n#LI-MN1"]},
{"title": "Data Engineer (Python skills) - Hong Kong - Indeed.hk", "content": ["Gather user requirements and perform data analysis;", "Implement business analytics solutions for customers (Big Data / Business Intelligence / Data Warehouse / Data Mining);", "Responsible for on-site testing and support activities to customers", "Program customized modules with Python", "Knowledge in Structured Query Language (SQL) required", "Hands-on experience in writing Python programming language", "Knowledge in either Business Intelligence, Big Data, Data Warehousing, or Data Mining or Machine Learning / Deep Learning preferred", "Strong analytical skill with good communication and interpersonal skills", "Java / R Programming Skill is advantageous", "Strong analytical skills, self-motivated and able to work under pressure", "Good interpersonal skills and able to work in a team", "Good command of both spoken and written in English and Mandarin (***fresh graduate is welcome for the position of Assistant Data Engineer)", "a learning company", "a consulting team without commission paid salesman", "a team of people solving problems for clients", "a team of people building our own big data products", "a team of people working with different big vendors", "An enablement course on BI concepts and training on Tools (such as: IBM Cognos, Information Server, DB2, SPSS, Alteryx, Cloudera, Tableau, Talend etc.)", "On Job Training – by experienced experts in this area", "Project Bonus, Annual Bonus, Medical Care, Share Options to top talents", "Studying Subsidies for a wide range of courses", "Education Subsidies", "Technical Laboratory / Technical Library for Staff Development", "Technical Book / Manual Library", "Career Development Path", "Assistant Data Engineer (Trainee)", "Data Engineer", "Senior Data Engineer/ Data Scientist", "Senior Data Scientist", "Managing Data Scientist", "Python: 1 year (Required)", "Cantonese, English, Putonghua (Preferred)"]},
{"title": "Dog Trainer / Junior Dog Trainer - Hong Kong - Indeed.hk", "content": ["Perform behavioral assessments of dogs arriving at the shelter and identify individual requirements for training, rehabilitation and enrichment, potential for rehoming, and suitability for a kennel environment;", "Develop training, enrichment, and behavioural modification programmes for dogs in the shelter. Work closely with other members of the Welfare Department in the implementation of these programmes, monitoring their progress and maintaining detailed records for each dog;", "Act as a mentor to instruct and supervise staff and volunteers in basic training methods for dogs in the shelter;", "Coordinate and deliver classes given by the SPCA Behaviour and Training team to the public, third parties, and internal staff, ensuring that excellent customer service is provided at all levels;", "Keep accurate records relating to the Behaviour and Training Department and to assist in data collection and report production as directed by the Welfare Manager;", "Manage the behaviour advice hotline, give pre-adoption advice to members of the public including discussing the ongoing implementation of training and behaviour modification programmes, and help implement and oversee a post-adoption system to support adopters.", "Assist with Outreach activities in China and the greater Asia region and Responsible Pet Ownership training and education;", "Carry out any other duties as assigned by the Welfare Manager.", "F. 5 or above with at least 3 years’ experience in dog training. Experience working in a shelter environment would be an advantage.", "Have practical experience handling difficult dogs and devising and implementing training and behavior modification programmes.", "Qualification from a recognized school of dog training whose training methods are in line with SPCA policy.", "Good command of both spoken and written English and Cantonese (Putonghua also beneficial)", "Independent and be able to work under pressure", "Good team player with strong communication and organisational skills", "A genuine interest in animal behavior and enthusiasm in working with animals, including the development of skills and knowledge related to animal training and the science of animal behavior"]},
{"title": "Data Scientist - Hong Kong - Indeed.hk", "content": ["Act as the technical data expertise in the team on model advising, with great flexibility on implementing state-of-the-art data science solution on your own way, to various business problems\n", "Your data science applications will be used to refresh the business process, which will have a significant impact to the company & the industry\n", "Gain deep knowledge in the technical aspect of insurance industry, e.g. customer analytics, underwriting, pricing\n", "Flexible working pattern, e.g. work from home\n", "Knowledge share among group data science community with big support\n", "Develop advanced AI / machine learning solutions leveraging shallow & deep learning technique in cloud environment for advanced analytics\n", "Drive improved business decision by leveraging different data science applications, e.g. model prediction, price sensitive analysis, AI recommendation system\n", "Develop & maintain various performance dashboard\n", "Set-up the Data science capability (incl. tools, platform and team) within the Life BU to steer innovative project and campaign to support New Business growth over the plan period\n", "Assess opportunity to improve underwriting and commercial pricing using Data Science tools and methodology\n", "Leverage and interact on regular basis with Group and Regional Data science community to get the best practices on boarded for AXA HK Life BU\n", "Scope is Life BU, with a primary focus on Life product, but rapidly expanded to Medical Reimbursement product", "\n", "3+ years’ experience in data science / engineer / analyst\n", "Experience in building & deploy large scale machine learning models, e.g. randomforest, xgboost, lightgbm, LSTM, etc\n", "Experience in any big data & cloud solution is a plus, e.g. HIVE, spark, Hadoop, Azure or AWS, etc\n", "Experience in API is a plus\n", "Strong organizational, problem solving & fast learner\n", "Strong communication skills to interact with senior management at local / regional / group level\n", "Able to work independently as well as a good team player\n", "Good command of business English, both in written and spoken form", "\n"]},
{"title": "Data Scientist - Hong Kong - Indeed.hk", "content": ["Responsible for the analytics pipeline from data extraction, blending, cleansing and processing to model creation and result visualization", "Gather, analyze data and build statistical models to conduct data analysis and create algorithms to predict probabilities", "Develop predictive and prescriptive models through programming in R or Python.", "Communicate quantitative insights into recommendations and present final results.", "Lead researches in the application of AI for stakeholders", "Identify and explore relevant data sources from internal and external sources, covering structured and unstructured data", "Design data collection, integration and retention requirements and framework", "Work with the IT system team to design and implement data-driven systems; and refine data collection process", "Degree holder in related disciplines", "Strong data project management, business process analysis and numerical skills", "Minimum of 3 years in managerial role of data science, analytics or data management", "Minimum of 6 years in data science, modeling and some scripting", "Hands on experience with machine learning models using Python or R", "Good command in using data management tools, data systems or related software", "Data visualization skills, preferred experience in Power BI, Quik or Tableau", "Fluency in English and Chinese are required", "Desire to work across various projects and enjoy strategically advising clients on emerging data techniques and initiatives."]},
{"title": "Student Intern [UG] - Hong Kong - Indeed.hk", "content": ["Good Chinese and English", "Willing to take lead in collaboration", "With some experience in handling\n"]},
{"title": "Data Center Technician - Intern - Hong Kong - Indeed.hk", "content": ["Relevant educational qualification majoring in Computer Science, Network Engineering, or Electronic Engineering.", "IT Hardware Concepts", "Understanding of basic computer/network concepts and terms", "x86 Architecture", "Experience in Microsoft office applications including but not limited to Outlook, MS Word, and MS Excel", "Good English written and read skills.", "Manage all aspect of a mission critical spare parts pool for server and network equipment", "Effectively troubleshoot and repair servers and networks", "Various hardware troubleshooting and replacement", "Server and networking equipment installation and removal", "Responsible for the RMA and repair process for all devices", "Support senior technicians in daily works and activities as directed", "Support project work"]}
]